twallis-cpr/proton-communication-comparison/micro_ros/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"

CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
CONFIG_FREERTOS_HZ=100
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=y
